In [3]:
import pandas as pd

In [4]:
fulldata = pd.read_csv(os.environ.get("TAXI_DATA"))
weatherdata = pd.read_excel(os.environ.get("WEATHER_DATA"))
holidaysdata = pd.read_excel(os.environ.get("HOLIDAY_DATA"))

In [7]:
#import pandas as pd
#fulldata=pd.read_csv("C:/Users/SHIVANSHI/IST718 Dropbox/IST 718 Project/Taxi Data/2015-01_100k.csv")
#weatherdata = pd.read_excel("C:/Users/SHIVANSHI/IST718 Dropbox/IST 718 Project/Weather Data/2015_weather.xlsx")
#holidaysdata = pd.read_excel("C:/Users/SHIVANSHI/IST718 Dropbox/IST 718 Project/Holiday Data/holidays.xlsx")

In [8]:
#import pandas as pd
#fulldata=pd.read_csv("C:/Users/SHAMA/IST718 Dropbox/IST 718 Project/Taxi Data/2015-01_100k.csv")
#weatherdata = pd.read_excel("C:/Users/SHAMA/IST718 Dropbox/IST 718 Project/Weather Data/2015_weather.xlsx")
#holidaysdata = pd.read_excel("C:/Users/SHAMA/IST718 Dropbox/IST 718 Project/Holiday Data/holidays.xlsx")

In [9]:
holidaysdata.head()
#dd.mm.yy

       Date                     Holiday
0  01.01.15               New Years Day
1  19.01.15  Martin Luther King Jr. Day
2  12.02.15          Lincoln's Birthday
3  16.02.15             Presidents' Day
4  10.05.15                Mother's Day

In [10]:
fulldata.head()

,VendorID,pickup_datetime,dropoff_datetime,passenger_count,trip_distance,pickup_longitude,pickup_latitude,RateCodeID,store_and_fwd_flag,dropoff_longitude,...,tip_amount,tolls_amount,improvement_surcharge,total_amount,pickup_zip,pickup_borough,pickup_neighborhood,dropoff_zip,dropoff_borough,dropoff_neighborhood
0,2,2015-01-06 11:39:29,2015-01-06 11:49:15,1,1.78,-73.999619,40.743599,1,N,-73.992203,...,0.00,0.0,0.3,9.80,10011,Manhattan,Chelsea and Clinton,10036,Manhattan,Chelsea and Clinton
1,1,2015-01-13 09:18:29,2015-01-13 09:23:40,1,2.10,-73.981956,40.778290,1,N,-73.962173,...,2.45,0.0,0.3,10.75,10023,Manhattan,Upper West Side,10024,Manhattan,Upper West Side
2,2,2015-01-16 07:15:44,2015-01-16 07:26:42,1,2.33,-73.991188,40.742226,1,N,-73.981613,...,1.00,0.0,0.3,11.80,10010,Manhattan,Gramercy Park and Murray Hill,10019,Manhattan,Chelsea and Clinton
3,1,2015-01-23 11:56:05,2015-01-23 12:13:20,1,2.10,-73.959297,40.763336,1,N,-73.979996,...,0.00,0.0,0.3,13.30,10065,Manhattan,Upper East Side,10023,Manhattan,Upper West Side
4,1,2015-01-24 10:11:48,2015-01-24 10:18:32,2,0.90,-73.971832,40.764751,1,N,-73.984047,...,0.00,0.0,0.3,7.30,10065,Manhattan,Upper East Side,10019,Manhattan,Chelsea and Clinton

In [11]:

datefrompickup=pd.to_datetime(fulldata['pickup_datetime']).apply(lambda x: x.date())
datefrompickup.head()
fulldata['pickup_date']=datefrompickup
fulldata.head()

,VendorID,pickup_datetime,dropoff_datetime,passenger_count,trip_distance,pickup_longitude,pickup_latitude,RateCodeID,store_and_fwd_flag,dropoff_longitude,...,tolls_amount,improvement_surcharge,total_amount,pickup_zip,pickup_borough,pickup_neighborhood,dropoff_zip,dropoff_borough,dropoff_neighborhood,pickup_date
0,2,2015-01-06 11:39:29,2015-01-06 11:49:15,1,1.78,-73.999619,40.743599,1,N,-73.992203,...,0.0,0.3,9.80,10011,Manhattan,Chelsea and Clinton,10036,Manhattan,Chelsea and Clinton,2015-01-06
1,1,2015-01-13 09:18:29,2015-01-13 09:23:40,1,2.10,-73.981956,40.778290,1,N,-73.962173,...,0.0,0.3,10.75,10023,Manhattan,Upper West Side,10024,Manhattan,Upper West Side,2015-01-13
2,2,2015-01-16 07:15:44,2015-01-16 07:26:42,1,2.33,-73.991188,40.742226,1,N,-73.981613,...,0.0,0.3,11.80,10010,Manhattan,Gramercy Park and Murray Hill,10019,Manhattan,Chelsea and Clinton,2015-01-16
3,1,2015-01-23 11:56:05,2015-01-23 12:13:20,1,2.10,-73.959297,40.763336,1,N,-73.979996,...,0.0,0.3,13.30,10065,Manhattan,Upper East Side,10023,Manhattan,Upper West Side,2015-01-23
4,1,2015-01-24 10:11:48,2015-01-24 10:18:32,2,0.90,-73.971832,40.764751,1,N,-73.984047,...,0.0,0.3,7.30,10065,Manhattan,Upper East Side,10019,Manhattan,Chelsea and Clinton,2015-01-24

In [12]:
mergeddata=fulldata.join(weatherdata,lsuffix='_fulldata', rsuffix='_weatherdata')
mergeddata.head()

,VendorID,pickup_datetime,dropoff_datetime,passenger_count,trip_distance,pickup_longitude,pickup_latitude,RateCodeID,store_and_fwd_flag,dropoff_longitude,...,pickup_neighborhood,dropoff_zip,dropoff_borough,dropoff_neighborhood,pickup_date_fulldata,pickup_date_weatherdata,avg_temp_C,Rain,Fog,Snow
0,2,2015-01-06 11:39:29,2015-01-06 11:49:15,1,1.78,-73.999619,40.743599,1,N,-73.992203,...,Chelsea and Clinton,10036,Manhattan,Chelsea and Clinton,2015-01-06,01.01.15,1.0,NaN,NaN,NaN
1,1,2015-01-13 09:18:29,2015-01-13 09:23:40,1,2.10,-73.981956,40.778290,1,N,-73.962173,...,Upper West Side,10024,Manhattan,Upper West Side,2015-01-13,02.01.15,4.0,NaN,NaN,NaN
2,2,2015-01-16 07:15:44,2015-01-16 07:26:42,1,2.33,-73.991188,40.742226,1,N,-73.981613,...,Gramercy Park and Murray Hill,10019,Manhattan,Chelsea and Clinton,2015-01-16,03.01.15,3.0,1.0,NaN,1.0
3,1,2015-01-23 11:56:05,2015-01-23 12:13:20,1,2.10,-73.959297,40.763336,1,N,-73.979996,...,Upper East Side,10023,Manhattan,Upper West Side,2015-01-23,04.01.15,9.0,1.0,NaN,NaN
4,1,2015-01-24 10:11:48,2015-01-24 10:18:32,2,0.90,-73.971832,40.764751,1,N,-73.984047,...,Upper East Side,10019,Manhattan,Chelsea and Clinton,2015-01-24,05.01.15,2.0,NaN,NaN,NaN

In [13]:
fulldata.merge(weatherdata, left_on='pickup_date',right_on='pickup_date',how='inner')

Empty DataFrame
Columns: [VendorID, pickup_datetime, dropoff_datetime, passenger_count, trip_distance, pickup_longitude, pickup_latitude, RateCodeID, store_and_fwd_flag, dropoff_longitude, dropoff_latitude, payment_type, fare_amount, extra, mta_tax, tip_amount, tolls_amount, improvement_surcharge, total_amount, pickup_zip, pickup_borough, pickup_neighborhood, dropoff_zip, dropoff_borough, dropoff_neighborhood, pickup_date, avg_temp_C, Rain, Fog, Snow]
Index: []

[0 rows x 30 columns]

In [14]:
weatherdata.head()

  pickup_date  avg_temp_C  Rain  Fog  Snow
0    01.01.15           1   NaN  NaN   NaN
1    02.01.15           4   NaN  NaN   NaN
2    03.01.15           3   1.0  NaN   1.0
3    04.01.15           9   1.0  NaN   NaN
4    05.01.15           2   NaN  NaN   NaN

In [15]:

weatherdata['pickup_date'] = pd.to_datetime(weatherdata['pickup_date'], format="%d.%m.%y", errors='coerce')
weatherdata.head()

  pickup_date  avg_temp_C  Rain  Fog  Snow
0  2015-01-01           1   NaN  NaN   NaN
1  2015-01-02           4   NaN  NaN   NaN
2  2015-01-03           3   1.0  NaN   1.0
3  2015-01-04           9   1.0  NaN   NaN
4  2015-01-05           2   NaN  NaN   NaN

In [16]:
weatherdata.tail()

    pickup_date  avg_temp_C  Rain  Fog  Snow
360  2015-12-27          12   1.0  NaN   NaN
361  2015-12-28           4   1.0  NaN   NaN
362  2015-12-29           4   1.0  NaN   NaN
363  2015-12-30           6   1.0  NaN   NaN
364  2015-12-31           7   1.0  NaN   NaN